USE S_MyBase
SELECT Детали.Количество_деталей AS AMOUNT_OF_DETAILS,
       COUNT(*) AS TOTAL_AUDITORIUMS,
       MIN(Детали.Количество_деталей) AS MIN_CAPACITY,
       MAX(Детали.Количество_деталей) AS MAX_CAPACITY,
       AVG(Детали.Количество_деталей) AS AVG_CAPACITY,
       SUM(Детали.Количество_деталей) AS TOTAL_CAPACITY
FROM Детали
INNER JOIN Операции at ON Детали.Сложность = Детали.Сложность
GROUP BY Детали.Количество_деталей;
----------------------------------------------------------------------------
SELECT GRADES.Результат, COUNT(*) AS Подсчёт_Стажа
FROM (
  SELECT CASE 
           WHEN Работники.Стаж >= 3 THEN '9-10'
           WHEN Работники.Стаж >= 2 THEN '7-8'
           WHEN Работники.Стаж >= 1 THEN '5-6'
           ELSE '0-4'
         END AS Результат,
         Работники.Стаж
  FROM Работники
  WHERE Работники.Стаж BETWEEN 1 AND 3
) AS GRADES
GROUP BY GRADES.Результат
ORDER BY GRADES.Результат DESC;
------------------------------------------------------------------------------
SELECT Работники.ID, Детали.Сложность, Операции.Признак_сложности, 
    ROUND(AVG(CAST(Детали.Сложность AS FLOAT)), 2) AS AVG_GRADE
FROM Работники
INNER JOIN Операции ON Работники.ID = Операции.Наименование_операции
INNER JOIN Детали ON Детали.Сложность = Операции.Признак_сложности
GROUP BY Работники.ID, Детали.Сложность, Операции.Признак_сложности
ORDER BY AVG_GRADE DESC;

------------------------------------------------------------------------------
SELECT 
  Работники.ID, 
  Работники.Стаж, 
  Работники.Операции, 
  Детали.Сложность, 
  ROUND(AVG(CAST(Детали.Сложность AS FLOAT)), 2) AS AVERAGE_GRADE
FROM 
  Работники
  JOIN Операции ON Работники.ID = Операции.Признак_сложности 
  JOIN Детали ON Работники.Стаж = Детали.Сложность  
WHERE 
  Работники.Стаж IN (1, 2)
GROUP BY 
  Работники.ID, 
  Работники.Стаж, 
  Детали.Сложность, 
  Работники.Операции 
ORDER BY 
  AVERAGE_GRADE DESC;
  -------------------------------------------------------------------------------------
SELECT Работники.ID AS SPECIALTY, Работники.Операции AS DISCIPLINE, ROUND(AVG(Работники.Стаж), 2) AS AVG_GRADE
FROM Работники
INNER JOIN Детали ON Работники.ID = Детали.Сложность
INNER JOIN Операции ON Работники.ID = Операции.Признак_сложности
WHERE Работники.ID = 1
GROUP BY Работники.ID, Операции.Признак_сложности, Работники.Операции;
---------------------------------------------------------------------------------
SELECT Работники.Стаж, COUNT(*) AS 'Workers with experience between 2 and 3 years'
FROM Работники
WHERE Работники.Стаж IN (2, 3)
GROUP BY Работники.Стаж
HAVING COUNT(*) > 0
ORDER BY COUNT(*) DESC;
